/* --------------------------- (C) COPYRIGHT 2021 Fortiortech ShenZhen -----------------------------
    File Name      : TIMER.c
    Author         : Fortiortech  Appliction Team
    Version        : V1.0
    Date           : 2021-04-11
    Description    : This file contains .C file function used for Motor Control.
----------------------------------------------------------------------------------------------------  
                                       All Rights Reserved
------------------------------------------------------------------------------------------------- */
#include <MyProject.h>

#include <TIMER.h>

void Timer1_Init(void)
{
    
}

void Timer2_Init(void)
{
	SetBit(PH_SEL , T2SEL);	    //P10
	SetBit(PH_SEL , T2SSEL);	//P07	
	ClrBit(TIM2_CR0 , T2PSC2);	//计数器时钟分频选择
	ClrBit(TIM2_CR0 , T2PSC1);	//000-->24M		001-->12M		010-->6M	011-->3M
	ClrBit(TIM2_CR0 , T2PSC0);	//100-->1.5M	101-->750K		110-->375K	111-->187.5K
	ClrBit(TIM2_CR0 , T2OCM);
	SetBit(TIM2_CR0 , T2IRE);	//比较匹配中断/脉宽检测中断0-->Disable  1-->Enable
	ClrBit(TIM2_CR0 , T2CES);	
	
	ClrBit(TIM2_CR1 , T2IPE);	//输入Timer PWM周期检测中断使能 0-->Disable  1-->Enable
	ClrBit(TIM2_CR1 , T2IFE);	//计数器上溢中断使能 0-->Disable  1-->Enable
	ClrBit(TIM2_CR1 , T2FE);	//输入噪声滤波使能，小于4个时钟周期脉宽滤除
	ClrBit(TIM2_CR1 , T2DIR);	//QEP&ISD&步进模式专用：当前的方向 0-->正向	1-->反向	
	
	TIM2__DR = 1200;
	TIM2__ARR = 2400;
    ClrBit(TIM2_CR0 , T2MOD1);	//00-->输入Timer模式  			01-->输出模式
	SetBit(TIM2_CR0 , T2MOD0);	//10-->输入Counter模式  		11-->QEP&ISD&步进模式
    SetBit(TIM2_CR1 , T2CEN);	//TIM2使能	0-->Disable  1-->Enable
}

/* -------------------------------------------------------------------------------------------------
    Function Name  : Timer3_Init
    Description    : 定时器3初始化
    Date           : 2021-11-08
    Parameter      : None
------------------------------------------------------------------------------------------------- */
void Timer3_Init(void)
{
	  //映射端口
		SetBit(PH_SEL  , T3SEL);     //Timer3端口使能
	  //启用功能转移
    SetBit(PH_SEL1 , T3CT0);     //默认端口为P11,功能转移后为P01,需TIMER4转移到P00
    SetBit(PH_SEL1 , T3CT1);     //默认端口为P11,功能转移后为P01,需TIMER4转移到P00
	
    //停止定时器
		ClrBit(TIM3_CR1, T3EN );			  // 0-停止计数；1-使能计数
	  //0 不复用 1 复用连接到 P1.1 P0.1 作为 TIM3的输入输出
		SetBit(PH_SEL,   T3SEL);					
	
	  //设置频率
		ClrBit(TIM3_CR0 , T3PSC2);	//计数器时钟分频选择
		ClrBit(TIM3_CR0 , T3PSC1);	//000-->24M		001-->12M		010-->6M	011-->3M
		ClrBit(TIM3_CR0 , T3PSC0);	//100-->1.5M	101-->750K		110-->375K	111-->187.5K
	
	  //设置计数器
    ClrBit(TIM3_CR0 , T3OCM);
		ClrBit(TIM3_CR0 , T3IRE);	//比较匹配中断/脉宽检测中断0-->Disable  1-->Enable
		ClrBit(TIM3_CR0 , T3OPM);	//0-->计数器不停止		1-->单次模式	
	
		ClrBit(TIM3_CR1 , T3IPE);	//输入Timer PWM周期检测中断使能 0-->Disable  1-->Enable
		ClrBit(TIM3_CR1 , T3IFE);	//计数器上溢中断使能 0-->Disable  1-->Enable
		SetBit(TIM3_CR1 , T3NM1);	//输入噪声脉宽选择
		SetBit(TIM3_CR1 , T3NM0);	//00-->不滤波	01-->4cycles    10-->8cycles  11-->16cycles
	
	  //设置PWM 20Khz  20250703 测试OK  BY LIJIE
		TIM3__DR  = 600 ;   
		TIM3__ARR = 1200;  //600/1200 50
	
	  //启用TIM3
    SetBit(TIM3_CR0 , T3MOD);   //0-->Timer模式       1-->输出模式
    SetBit(TIM3_CR1 , T3EN);    //TIM3使能    0-->Disable  1-->Enable
}

void Timer4_Init(void)
{
	/*-------------------------------------------------------------------------------------------------
	先停止计数器，等配置完寄存器后，再重新启动计数器
	-------------------------------------------------------------------------------------------------*/
	ClrBit(TIM4_CR1, T4EN);                                        // 0-停止计数;1-使能计数
	ClrBit(PH_SEL,   T4SEL);                                         //0-不连接到端口GP11;1-连接到端口GP11
	
  SetBit(PH_SEL1, T4CT1);      //转移到P00
	SetBit(PH_SEL1, T4CT0); 
	
	/******************************************************************************///TIM4
// SFR(TIM4_CR0, 0x9e); //sfr		TIM4_CR0					   = 0x9e;								   // RV:  00H	TIMER4控制寄存器0
// #define T4PSC2									  0x80							//				 rw-- 定时器分频配置2
// #define T4PSC1									  0x40							//				 rw-- 定时器分频配置1
// #define T4PSC0									  0x20							//				 rw-- 定时器分频配置0
// #define T4OCM									  0x10							//				 rw-- 定时器比较匹配/捕获脉宽模式配置
// #define T4IRE									  0x08							//				 rw-- 比较匹配/捕获脉宽中断
// #define T4OPM									  0x02							//				 rw-- 单次模式使能
// #define T4MOD									  0x01							//				 rw-- 定时器模式配置0
		/*-------------------------------------------------------------------------------------------------
		时钟分频设置(T5PSC)
		000:cpuclk        001:cpuclk/2^1  010:cpuclk/2^2  011:cpuclk/2^3
		100:cpuclk/2^4    101:cpuclk/2^5  110:cpuclk/2^6  111:cpuclk/2^7
		-------------------------------------------------------------------------------------------------*/
		SetReg(	TIM4_CR0, 
						T4PSC0 | T4PSC1 | T4PSC2, 
						T4PSC0 | T4PSC2 );
	
	/*-------------------------------------------------------------------------------------------------
	模式选择：
	0：输入timer模式
	1：输出模式
	-------------------------------------------------------------------------------------------------*/
	SetBit(TIM4_CR0, T4MOD);                                 // 1，选择输出模式    ;0，选择输入模式
	ClrBit(TIM4_CR0, T4OCM);                                 // 0:上升沿触发，高电平位脉宽  1:下降沿触发，低电平为脉宽
	ClrBit(TIM4_CR1, T4IR | T4IF | T4IP);              // 清除中断标志位
	SetBit(TIM4_CR1, T4IFE);                   // 输入有效边沿变化中断使能和基本计时器上溢使能

	SetBit(IP2, PTIM41);  // TIM4/5中断优先级
	ClrBit(IP2, PTIM40);  //
	EA = 1;
	
//	TIM4__ARR = (uint32)TIM4_Fre / BuzzerRingFrq;
//	TIM4__DR = ((uint32)TIM4_Fre >> 1) / BuzzerRingFrq;

	TIM4__ARR = 1;
	TIM4__DR = 30000000;
}

void TIM3_Init_RF(void)
{
/*-------------------------------------------------------------------------------------------------
  先停止计数，配置完寄存器后，最后启动计数
-------------------------------------------------------------------------------------------------*/
	ClrBit(TIM3_CR1, T3EN);			  // 0-停止计数；1-使能计数
//	ClrBit(PH_SEL, T3SEL);				//0-不复用；1-连接到端口P1.1 或 P0.1 作为 Timer3 的输入输出
	
  SetBit(PH_SEL1, T3CT1);      //转移到P01
	SetBit(PH_SEL1, T3CT0); 	
	
/*-------------------------------------------------------------------------------------------------
	时钟分频设置(T2PSC)
  000:cpuclk(24MHz)			001:cpuclk/2^1(12MHz)	010:cpuclk/2^2(6MHz)	011:cpuclk/2^3(3MHz)
  100:cpuclk/2^4(1.5MHz)	101:cpuclk/2^5(750KHz)	110:cpuclk/2^6(375KHz)	111:cpuclk/2^7(187.5KHz)
-------------------------------------------------------------------------------------------------*/
	SetReg(TIM3_CR0, T3PSC2 | T3PSC1 | T3PSC0, T3PSC1 | T3PSC0);

/*-------------------------------------------------------------------------------------------------
	/模式选择
	0-输入模式
  1-输出模式
-------------------------------------------------------------------------------------------------*/
	ClrBit(TIM3_CR0, T3MOD);

	ClrBit(TIM3_CR0, T3OCM);

/*-------------------------------------------------------------------------------------------------
	/滤波时间
	00-不滤波；01-8个时钟周期
  10-16个时钟周期；11-32个时钟周期
-------------------------------------------------------------------------------------------------*/
	SetReg(TIM3_CR1, T3NM1 | T3NM0, T3NM0);
/*-------------------------------------------------------------------------------------------------
  清除中断标志位
	禁止PWM周期检测中断使能
	使能计数器上溢中断使能
-------------------------------------------------------------------------------------------------*/
	ClrBit(TIM3_CR1, T3IR | T3IF | T3IP);		                   // 清除中断标志位
	SetBit(TIM3_CR1, T3IFE);				                          // 输入有效边沿变化中断使能和基本计数器上溢使能
	SetBit(TIM3_CR1, T3IPE);				                          // 输入有效边沿变化中断使能和基本计数器上溢使能
/*-------------------------------------------------------------------------------------------------
	定时器2中断优先级配置及芯片中断总使能
	PTIM31-PTIM30，中断优先级控制值从0-3依次表示优先级从最低到最高，共4级优化级控制
	EA,芯片中断总使能
-------------------------------------------------------------------------------------------------*/
	ClrBit(TIM3_CR0, T3OPM);

	SetBit(IP2, PTIM31);
	ClrBit(IP2, PTIM30);  //									                         // TIM2/3中断优先级别为2
	EA = 1;

/*-------------------------------------------------------------------------------------------------
  配置周期值、比较值、计数值
-------------------------------------------------------------------------------------------------*/
	TIM3__CNTR = 0;
	TIM3__ARR = 1200;
	TIM3__DR = 720;

	ClrBit(PH_SEL, T3SEL);                          //0-不复用；1-连接到端口P1.1 或 P0.1 作为 Timer3 的输入输出
	
// #define T3CT1									  0x02							//				 rw-- TIM3功能转移
// #define T3CT0									  0x01							//				 rw-- TIM3功能转移	
	
	SetBit(PH_SEL1,T3CT1);// 00: P1.1 为 Timer3 输入输出 ; X1: P0.1 为 Timer3 输入输出;  10: P4.7 为 Timer3 输入

	SetBit(PH_SEL1,T3CT0);   
	SetBit(TIM3_CR1, T3EN);
}

void TIM1ms_Init(void)
{	
	ClrBit(IP2, PSYSTICK1);    //1ms定时中断优先级别为1
	SetBit(IP2, PSYSTICK0);
	
	SetBit(DRV_SR, SYSTIE);
	EA = 1;
}